
&НаКлиенте
Процедура Загрузить(Команда)
	Файл = Новый Файл(ПутьКФото);
	Если Файл.Существует() Тогда 
		ДД = Новый ДвоичныеДанные(ПутьКФото);
		ЗагрузитьНаСервере(ДД);
		ЭтаФорма.Модифицированность = Ложь;
		ОбновитьФото();
	Иначе
		Сообщить("Выберите файл картинки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФотоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите картинку для загрузки";
	Диалог.Фильтр = "Рисунок JPG(*.jpg)|*.jpg|Рисунок PNG(*.png)|*.png"; 
	Если Диалог.Выбрать() Тогда
		ПутьКФото = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ДД)
	Хранилище = Новый ХранилищеЗначения(ДД);
	Об = РеквизитФормыВЗначение("Объект");
	Об.Фото = Хранилище;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");  	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФото()
	Фото = ПоместитьВоВременноеХранилище(Объект.Ссылка.Фото.Получить(), УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФото();
КонецПроцедуры


//процедура добавления игрока в пользователи
&НаСервере
Процедура ДобавитьПользователя(лог, пар, фио)
	//проверка на наличие пользователя
	Если ПустаяСтрока(ПользователиИнформационнойБазы.НайтиПоИмени(фио)) тогда
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = лог;
		НовыйПользователь.ПолноеИмя = фио;
		НовыйПользователь.Пароль = пар;
		если Объект.Должность = Справочники.Должность.СистемныйАдминитсратор тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.СистемныйАдминистратор);
		ИначеЕсли Объект.Должность = Справочники.Должность.Директор тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.Директор);
		ИначеЕсли Объект.Должность = Справочники.Должность.АдминистраторМагазина тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.АдминистраторМагазина);
		ИначеЕсли Объект.Должность = Справочники.Должность.ПродавецКонсультант тогда
			НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПродавецКонсультант);
		КонецЕсли;
		НовыйПользователь.Записать();
		Сообщить("Пользователь успешно создан!");
		Иначе Сообщить("Данный пользователь уже сущетсвует в базе! Пожалуйста, обратитесь к системному администратору!");
	КонецЕсли;
КонецПроцедуры

//генерация пароля
Функция ГенерацияПароляИЛогина()
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	Пароль = "";
	Неиспользуемые = ":<=>?@;[\]^_`";
	Пока СтрДлина(Пароль) < 7 Цикл
		НекийСимвол = Символ(ГСЧ.СлучайноеЧисло(48, 122));
		//Сначала получаем число из диапазона между 48 и 122
		//И получаем его символ по ASCII
		Если Найти(Неиспользуемые, НекийСимвол) > 0 Тогда//проверка на исключения
			Продолжить;
		КонецЕсли;
		Пароль = Пароль + НекийСимвол;
	КонецЦикла;        
	Возврат НРег(Пароль);
КонецФункции

&НаКлиенте
Процедура ГенерацияЛогина(Команда)
	Объект.Логин = ГенерацияПароляИЛогина();
КонецПроцедуры

&НаКлиенте
Процедура ГенерацияПароля(Команда)
	Объект.Пароль = ГенерацияПароляИЛогина();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПользователя(Команда)
	лог = Объект.Логин;
	пар = Объект.Пароль;
	фио = Объект.Наименование;
	ДобавитьПользователя(лог, пар, фио);
КонецПроцедуры
